In [3]:
import quandl
mydata_01 = quandl.get("FRED/GDP")

In [4]:
mydata_01.tail()

                Value
Date
2018-10-01  20897.804
2019-01-01  21098.827
2019-04-01  21340.267
2019-07-01  21542.540
2019-10-01  21734.266

In [5]:
mydata_01.head()

              Value
Date
1947-01-01  243.164
1947-04-01  245.968
1947-07-01  249.585
1947-10-01  259.745
1948-01-01  265.742

In [10]:
import pandas as pd

In [12]:
mydata_01.to_csv('/Users/dimitritsioutsiopoulos/Desktop/Python/New_Files/example_01.csv')

In [15]:
mydata_02 = pd.read_csv('/Users/dimitritsioutsiopoulos/Desktop/Python/New_Files/example_01.csv')

In [16]:
mydata_02.head()

         Date    Value
0  1947-01-01  243.164
1  1947-04-01  245.968
2  1947-07-01  249.585
3  1947-10-01  259.745
4  1948-01-01  265.742

In [17]:
mydata_02.tail()

           Date      Value
287  2018-10-01  20897.804
288  2019-01-01  21098.827
289  2019-04-01  21340.267
290  2019-07-01  21542.540
291  2019-10-01  21734.266

In [18]:
mydata_02 = pd.read_csv('/Users/dimitritsioutsiopoulos/Desktop/Python/New_Files/example_01.csv', index_col='Date')

In [19]:
mydata_02

                Value
Date
1947-01-01    243.164
1947-04-01    245.968
1947-07-01    249.585
1947-10-01    259.745
1948-01-01    265.742
...               ...
2018-10-01  20897.804
2019-01-01  21098.827
2019-04-01  21340.267
2019-07-01  21542.540
2019-10-01  21734.266

[292 rows x 1 columns]